app/controllers/school_classes_controller.rb

    def create
      @school_class = SchoolClass.create(school_class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]

    def update
      set_school_class.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]

    def set_school_class
      @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]