app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-09-05 14:28:43.859867"], ["updated_at", "2017-09-05 14:28:43.859867"]]
---
  def create
    @student = Student.create(student_params(:first_name, :last_name))

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-09-05 14:53:54.738899"], ["id", 1]]
---
  def update
    set_student.update(student_params(:first_name, :last_name))